artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  variables:
    email: "load-test-{{ $randomString() }}@example.com"
    password: "Test123!@#"

scenarios:
  - name: "Signup and Login Flow"
    flow:
      - post:
          url: "/api/v1/auth/signup"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
            name: "Load Test User"
            workspaceName: "Test Workspace"
          capture:
            - json: "$.data.tokens.accessToken"
              as: "token"
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
      - get:
          url: "/api/v1/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"